Revit 2024 API
MEPNetworkSegmentId.SegmentId Property
 The segment identifier.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int SegmentId { get; set; }
Visual Basic
Public Property SegmentId As Integer
	Get
	Set
Visual C++
public:
property int SegmentId {
	int get ();
	void set (int value);
}
See Also
MEPNetworkSegmentId Class
Autodesk.Revit.DB.Analysis Namespace